verylinkedin/load-testing/posts.yml
# Use this command to run the tests and generate a json file with the report
# generate a different json file for each report as they override each other
# artillery run --output report.json NAME_OF_SCRIPT.yaml
config:
  target: "http://localhost:8080/api/v1/posts/"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "create post"
    flow:
      - post:
          url: "/createPost"
          json:
            userId: "1"
            content: "hi hamada"